In [35]:
# !pip install pandas

In [36]:
# import pandas as pd

In [37]:
# df = pd.read_csv("Used_Bikes.csv")

In [38]:
# df.info

In [39]:
# df

In [40]:
# df.head()

In [41]:
# df.tail()

In [42]:
# df.columns

In [43]:
# df.describe()

In [44]:
# df.isnull()

In [45]:
# df.isnull().sum()

In [46]:
# df.duplicated()

In [47]:
# df.duplicated().sum()

In [48]:
# df['brand']

In [49]:
# df['brand'].unique()

In [50]:
# df['brand'].nunique()

In [51]:
# df['brand'].value_counts()

In [52]:
# df.drop_duplicates(inplace=True)

In [53]:
# df.duplicated().sum()

In [54]:
# df

In [55]:
# df['brand'].value_counts()

In [56]:
# df =df.drop(['city','bike_name'], axis=1 )

In [57]:

# df

In [58]:
# cat_col =df.select_dtypes(include='object')

In [59]:
# cat_col

In [60]:
# num_cal=df.select_dtypes(exclude='object')

In [61]:

# num_cal

In [ ]:
### bike brand = tvs
### kms = 50000
### price = 50000

tvs_df=df[df['brand'] == 'TVS']

In [63]:
# tvs_df[tvs_df['kms_driven'] == 50000]

In [64]:
# brand == Royal Enfield
# price = 100000
# kms = 30000
# owner = first owner

# # bike availabality

In [ ]:
roy_df=df[df['brand'] == 'Royal Enfield']
roy_df=roy_df[roy_df['kms_driven'] == 30000]
roy_df=roy_df[roy_df['owner'] == 'First Owner']
roy_df=roy_df[roy_df['price'] <= 100000]
roy_df

         price  kms_driven        owner   age  power          brand
1311   80000.0     30000.0  First Owner   5.0  350.0  Royal Enfield
3783   65000.0     30000.0  First Owner  11.0  350.0  Royal Enfield
5593   75000.0     30000.0  First Owner  10.0  350.0  Royal Enfield
6485   70000.0     30000.0  First Owner  11.0  350.0  Royal Enfield
6716  100000.0     30000.0  First Owner   5.0  350.0  Royal Enfield
6719   75000.0     30000.0  First Owner  10.0  350.0  Royal Enfield
7716  100000.0     30000.0  First Owner   7.0  350.0  Royal Enfield
8012   75000.0     30000.0  First Owner   9.0  350.0  Royal Enfield

In [79]:
roy_df=df[(df['brand'] == 'Royal Enfield')&(df['kms_driven'] == 30000)&(df['owner'] == 'First Owner')&(df['price'] <= 100000)]

In [80]:
roy_df

         price  kms_driven        owner   age  power          brand
1311   80000.0     30000.0  First Owner   5.0  350.0  Royal Enfield
3783   65000.0     30000.0  First Owner  11.0  350.0  Royal Enfield
5593   75000.0     30000.0  First Owner  10.0  350.0  Royal Enfield
6485   70000.0     30000.0  First Owner  11.0  350.0  Royal Enfield
6716  100000.0     30000.0  First Owner   5.0  350.0  Royal Enfield
6719   75000.0     30000.0  First Owner  10.0  350.0  Royal Enfield
7716  100000.0     30000.0  First Owner   7.0  350.0  Royal Enfield
8012   75000.0     30000.0  First Owner   9.0  350.0  Royal Enfield

In [84]:
df.query('brand == "Royal Enfield" and kms_driven == 30000 and owner == "First Owner" and price <= 100000')

         price  kms_driven        owner   age  power          brand
1311   80000.0     30000.0  First Owner   5.0  350.0  Royal Enfield
3783   65000.0     30000.0  First Owner  11.0  350.0  Royal Enfield
5593   75000.0     30000.0  First Owner  10.0  350.0  Royal Enfield
6485   70000.0     30000.0  First Owner  11.0  350.0  Royal Enfield
6716  100000.0     30000.0  First Owner   5.0  350.0  Royal Enfield
6719   75000.0     30000.0  First Owner  10.0  350.0  Royal Enfield
7716  100000.0     30000.0  First Owner   7.0  350.0  Royal Enfield
8012   75000.0     30000.0  First Owner   9.0  350.0  Royal Enfield

In [101]:
df.query('brand == "Hero" and age >= 2 and owner == "Second Owner" and price <= 50000')

        price  kms_driven         owner   age  power brand
377   38000.0     17376.0  Second Owner   5.0  100.0  Hero
592   32000.0     21884.0  Second Owner   8.0  100.0  Hero
805   23000.0     25000.0  Second Owner   6.0  125.0  Hero
1046  22100.0     24000.0  Second Owner   7.0  100.0  Hero
1068  34500.0     80000.0  Second Owner  10.0  150.0  Hero
...       ...         ...           ...   ...    ...   ...
8685  16800.0     35000.0  Second Owner  13.0  100.0  Hero
8925  16000.0     26512.0  Second Owner  16.0  100.0  Hero
8929  30000.0     40000.0  Second Owner   5.0  125.0  Hero
9029  14000.0     50000.0  Second Owner  19.0  100.0  Hero
9339  11400.0     20000.0  Second Owner  17.0  100.0  Hero

[78 rows x 6 columns]

In [96]:
hero_df = df[
    (df['brand'] == 'Hero') &
    (df['price'] <= 50000) &
    (df['owner'] == 'Second owner') &
    (df['age'] >= 2)
]

In [97]:
hero_df

Empty DataFrame
Columns: [price, kms_driven, owner, age, power, brand]
Index: []

In [102]:
df

         price  kms_driven        owner  age  power            brand
0      35000.0     17654.0  First Owner  3.0  110.0              TVS
1     119900.0     11000.0  First Owner  4.0  350.0    Royal Enfield
2     600000.0       110.0  First Owner  8.0  675.0          Triumph
3      65000.0     16329.0  First Owner  4.0  180.0              TVS
4      80000.0     10000.0  First Owner  3.0  150.0           Yamaha
...        ...         ...          ...  ...    ...              ...
9362   25000.0     48587.0  First Owner  8.0  150.0             Hero
9369   35000.0     60000.0  First Owner  9.0  220.0            Bajaj
9370  450000.0      3430.0  First Owner  4.0  750.0  Harley-Davidson
9371  139000.0     21300.0  First Owner  4.0  400.0            Bajaj
9372   80000.0      7127.0  First Owner  5.0  220.0            Bajaj

[7324 rows x 6 columns]

In [103]:
df['owner'].unique()

array(['First Owner', 'Second Owner', 'Third Owner',
       'Fourth Owner Or More'], dtype=object)

In [105]:
owner_dict={'First Owner':1, 'Second Owner':2, 'Third Owner':3,
       'Fourth Owner Or More:':4}

In [106]:
owner_dict

{'First Owner': 1,
 'Second Owner': 2,
 'Third Owner': 3,
 'Fourth Owner Or More:': 4}

In [107]:
df['owner']=df['owner'].map(owner_dict)

In [109]:
df

         price  kms_driven  owner  age  power            brand
0      35000.0     17654.0    1.0  3.0  110.0              TVS
1     119900.0     11000.0    1.0  4.0  350.0    Royal Enfield
2     600000.0       110.0    1.0  8.0  675.0          Triumph
3      65000.0     16329.0    1.0  4.0  180.0              TVS
4      80000.0     10000.0    1.0  3.0  150.0           Yamaha
...        ...         ...    ...  ...    ...              ...
9362   25000.0     48587.0    1.0  8.0  150.0             Hero
9369   35000.0     60000.0    1.0  9.0  220.0            Bajaj
9370  450000.0      3430.0    1.0  4.0  750.0  Harley-Davidson
9371  139000.0     21300.0    1.0  4.0  400.0            Bajaj
9372   80000.0      7127.0    1.0  5.0  220.0            Bajaj

[7324 rows x 6 columns]

In [110]:
df['brand'].unique()

array(['TVS', 'Royal Enfield', 'Triumph', 'Yamaha', 'Honda', 'Hero',
       'Bajaj', 'Suzuki', 'Benelli', 'KTM', 'Mahindra', 'Kawasaki',
       'Ducati', 'Hyosung', 'Harley-Davidson', 'Jawa', 'BMW', 'Indian',
       'Rajdoot', 'LML', 'Yezdi', 'MV', 'Ideal'], dtype=object)

In [111]:
brand_dict = {
    'TVS':0, 'Royal Enfield':1, 'Triumph':2, 'Yamaha':3, 'Honda':4, 'Hero':5,
       'Bajaj':6, 'Suzuki':7, 'Benelli':8, 'KTM':9, 'Mahindra':10, 'Kawasaki':11,
       'Ducati':12, 'Hyosung':13, 'Harley-Davidson':14, 'Jawa':15, 'BMW':16, 'Indian':17,
       'Rajdoot':18, 'LML':19, 'Yezdi':20, 'MV':21, 'Ideal':22
}

In [112]:
df['brand']=df['brand'].map(brand_dict)

In [113]:
df

         price  kms_driven  owner  age  power  brand
0      35000.0     17654.0    1.0  3.0  110.0      0
1     119900.0     11000.0    1.0  4.0  350.0      1
2     600000.0       110.0    1.0  8.0  675.0      2
3      65000.0     16329.0    1.0  4.0  180.0      0
4      80000.0     10000.0    1.0  3.0  150.0      3
...        ...         ...    ...  ...    ...    ...
9362   25000.0     48587.0    1.0  8.0  150.0      5
9369   35000.0     60000.0    1.0  9.0  220.0      6
9370  450000.0      3430.0    1.0  4.0  750.0     14
9371  139000.0     21300.0    1.0  4.0  400.0      6
9372   80000.0      7127.0    1.0  5.0  220.0      6

[7324 rows x 6 columns]

In [114]:
df.corr()

               price  kms_driven     owner       age     power     brand
price       1.000000   -0.199951 -0.003305 -0.248752  0.807641  0.288409
kms_driven -0.199951    1.000000  0.063422  0.367518 -0.168295 -0.036161
owner      -0.003305    0.063422  1.000000  0.189560  0.042835  0.013768
age        -0.248752    0.367518  0.189560  1.000000 -0.164211 -0.030263
power       0.807641   -0.168295  0.042835 -0.164211  1.000000  0.068647
brand       0.288409   -0.036161  0.013768 -0.030263  0.068647  1.000000

In [115]:
x= df.drop('price',axis=1)
y = df[['price']]

In [117]:
x

      kms_driven  owner  age  power  brand
0        17654.0    1.0  3.0  110.0      0
1        11000.0    1.0  4.0  350.0      1
2          110.0    1.0  8.0  675.0      2
3        16329.0    1.0  4.0  180.0      0
4        10000.0    1.0  3.0  150.0      3
...          ...    ...  ...    ...    ...
9362     48587.0    1.0  8.0  150.0      5
9369     60000.0    1.0  9.0  220.0      6
9370      3430.0    1.0  4.0  750.0     14
9371     21300.0    1.0  4.0  400.0      6
9372      7127.0    1.0  5.0  220.0      6

[7324 rows x 5 columns]

In [118]:
y

         price
0      35000.0
1     119900.0
2     600000.0
3      65000.0
4      80000.0
...        ...
9362   25000.0
9369   35000.0
9370  450000.0
9371  139000.0
9372   80000.0

[7324 rows x 1 columns]

In [ ]:
roy_df=df.query('brand == 1   and age >= 3 and  price <= 100000')
roy_df
roy_df['price'].min()

np.float64(33500.0)

In [140]:
roy_df['brand'].value_counts()

brand
1    549
Name: count, dtype: int64

In [135]:
roy_df['price'].max()

np.float64(100000.0)

In [132]:
ktm_df= df.query('brand == 9   and age >= 3 and  price <= 100000')
ktm_df
ktm_df['price'].min()

np.float64(55000.0)

In [133]:
ktm_df['price'].max()

np.float64(100000.0)

In [141]:
ktm_df['brand'].value_counts()

brand
9    60
Name: count, dtype: int64